[
	{
	  "id": "hanuman_sun",
	  "title": "Hanuman Tried to Eat the Sun",
	  "image": "/images/hanuman_sun.jpg",
	  "summary": "As a child, Hanuman mistook the sun for a mango and tried to eat it.",
	  "story": "Hanuman, the divine monkey, once leapt across the sky believing the sun was a ripe mango. His power was so immense that the gods grew worried. Indra struck him with a thunderbolt, injuring his jaw — thus giving him the name 'Hanuman' (from 'Hanu' meaning jaw in Sanskrit). This story shows his strength and innocence as a child."
	},
	{
	  "id": "shiva_ganga",
	  "title": "Shiva Tamed the Ganga",
	  "image": "/images/shiva_ganga.jpg",
	  "summary": "To calm the mighty Ganga's descent, Shiva captured her in his hair.",
	  "story": "When the celestial river Ganga was sent to Earth, her force threatened to destroy the planet. Lord Shiva allowed her to fall on his matted hair (jata), which slowed her descent and split her into many streams, forming the sacred Ganges. This divine act made the river a lifeline of India and a symbol of purity."
	},
	{
	  "id": "krishna_butter",
	  "title": "Krishna the Butter Thief",
	  "image": "/images/krishna_butter.jpg",
	  "summary": "Young Krishna would sneak into homes to steal butter with his friends.",
	  "story": "Little Krishna of Vrindavan had a notorious habit of stealing butter from villagers. His mother Yashoda once caught him red-handed, and tied him to a wooden mortar. But Krishna dragged it between two trees, breaking them apart — revealing two cursed celestial beings. Even in mischief, Krishna brought liberation and joy."
	},
	{
	  "id": "ganesha_head",
	  "title": "Why Ganesha Has an Elephant Head",
	  "image": "/images/ganesha_head.jpg",
	  "summary": "Ganesha was beheaded by Shiva and revived with an elephant's head.",
	  "story": "Goddess Parvati created Ganesha from sandalwood paste to guard her while she bathed. When Shiva returned and was denied entry, he beheaded Ganesha in anger. To appease Parvati, Shiva replaced Ganesha’s head with that of a sacred elephant. Ganesha was granted eternal worship before all other gods as the remover of obstacles."
	},
	{
	  "id": "narasimha",
	  "title": "The Fierce Narasimha Avatar",
	  "image": "/images/narasimha.jpg",
	  "summary": "Vishnu appeared as half-man, half-lion to defeat the demon Hiranyakashipu.",
	  "story": "Hiranyakashipu, granted a boon to avoid death by man or beast, day or night, indoors or outdoors, grew arrogant. His son Prahlad remained devoted to Vishnu. To protect him, Vishnu appeared as Narasimha (man-lion), at twilight (neither day nor night), on a threshold (neither indoors nor out), and tore the demon apart. This avatar embodies divine justice."
	},
	{
		"id": "durga_buffalo_demon",
		"title": "Durga and the Buffalo Demon Mahishasura",
		"image": "/images/durga_mahishasura.jpg",
		"summary": "Goddess Durga battled the invincible demon Mahishasura for nine nights.",
		"story": "Mahishasura was granted a boon that no man or god could kill him. He terrorized the heavens, defeating all deities. The gods combined their energies to create Goddess Durga, who rode into battle with ten arms and divine weapons. After nine days of intense war, she beheaded Mahishasura on the tenth day, now celebrated as Vijayadashami."
	  },
	  {
		"id": "saraswati_birth",
		"title": "Saraswati: The River Who Became a Goddess",
		"image": "/images/saraswati_goddess.jpg",
		"summary": "Goddess Saraswati emerged from Brahma and became the embodiment of wisdom.",
		"story": "When Brahma created the universe, it was chaotic and disordered. To bring balance and understanding, he created Saraswati — goddess of knowledge, speech, and art. Her presence brought clarity to creation. Once a flowing river, she evolved into a divine force behind learning, music, and purity of mind."
	  },
	  {
		"id": "vishnu_vamana",
		"title": "Vishnu's Vamana Avatar: The Tiny Giant",
		"image": "/images/vamana_vishnu.jpg",
		"summary": "Vishnu took the form of a dwarf to humble the demon king Bali.",
		"story": "King Bali, though virtuous, grew powerful and sought to rule all three worlds. Vishnu appeared as a dwarf (Vamana) and asked for three steps of land. Granted permission, Vamana expanded to cosmic size: one step covered Earth, second the heavens, and for the third, Bali offered his head. Vishnu blessed him and sent him to rule the underworld with honor."
	  }
  ]
  